In [1]:
import pandas as pd
import os

import numpy as np

# Deliverable 1: Collect the Data

In [2]:
# Create the path and import the data

full_student_data = os.path.join('Resources', 'new_full_student_data.csv')

student_df = pd.read_csv(full_student_data)

# Verify that the data was properly imported

student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

# Deliverable 2: Prepare the Data

In [3]:
# Check for null values

student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [4]:
# Drop rows with null values and verify removal

student_df.dropna().isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [5]:
# Check for duplicated rows

student_df.duplicated().sum()

2168

In [6]:
# Drop duplicated rows and verify removal

student_df = student_df.drop_duplicates()

student_df.duplicated().sum()

0

In [7]:
# Check Data types

student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [8]:
# Examine the grade column to understand why it is not an int

student_df['grade']

0         9th
1         9th
2         9th
3         9th
4        11th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 17346, dtype: object

In [9]:
# Remove the non-numeric characters and verify the contents of the column

student_df['grade'] = student_df['grade'].str.replace('th', '')

student_df['grade']

0         9
1         9
2         9
3         9
4        11
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 17346, dtype: object

In [10]:
# Change the grade column to the int type and verify column types

student_df['grade'] = student_df['grade'].astype(int)

student_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

# Deliverable 3: Summarize the Data

In [11]:
# Display summary statistics for the DataFrame

student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.734600e+04  17346.000000   15611.000000  16479.000000   17346.000000
mean   6.971921e+07     10.356393      72.371046     64.715899  893753.090741
std    3.458822e+07      1.097201      15.206900     15.827649   53950.325200
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.962676e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.961437e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.944595e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [12]:
# Display the mean math score using the mean function

student_df["math_score"].mean()

64.71589902299891

In [13]:
# Store the minimum reading score as min_reading_score

min_reading_score = student_df["reading_score"].min()

min_reading_score

10.5

# Deliverable 4: Drill Down into the Data

In [14]:
# Use loc to display the grade column

student_df.loc[:, "grade"]

0         9
1         9
2         9
3         9
4        11
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 17346, dtype: int64

In [15]:
# Use iloc to display the first 3 rows and columns 3, 4, y 5.

student_df.iloc[0:3, 3:6]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [16]:
# Select the rows for grade nine and display their summary statistics using 'loc' and 'describe'

student_df.loc[student_df["grade"]==9].describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.832000e+03  4832.0    4353.000000  4587.000000    4832.000000
mean   6.973426e+07     9.0      69.322927    66.686222  898548.483858
std    3.468975e+07     0.0      15.287125    16.692797   54770.293534
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.957139e+07     9.0      59.100000    56.100000  846745.000000
50%    6.984037e+07     9.0      70.100000    67.800000  893368.000000
75%    9.942976e+07     9.0      80.600000    78.600000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [18]:
# Store the row with the minimum overall reading score as 'min_reading_row'
# Using 'loc' and the 'min_reading_score' found in Deliverbale 3.

min_reading_row = student_df.loc[student_df["reading_score"]==min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [19]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.

student_df.loc[(student_df["school_name"] == "Dixon High School") & (student_df["grade"] == 10), 
                    ["school_name", "reading_score"]]

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[654 rows x 2 columns]

In [20]:
# Find the mean reading score for all students in grades 11 and 12 combined

student_df.loc[student_df["grade"] > 10, "reading_score"].mean()

74.89692075471689

# Deliverable 5: Compare the Data

In [21]:
# Display the average budget for each school type.

school_budget = student_df.groupby("school_type").mean()
school_budget.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872636.854504
Public       911205.058545

In [22]:
# Use the groupby, count and sort values functions to find the total number of students
# at each school and sort from most students to least students.

new_student_df = student_df.assign(student_count=9)
student_total = new_student_df.groupby(by='school_name').count()
student_total.loc[:, ['student_count']].sort_values(by = 'student_count', ascending=False)

                        student_count
school_name
Montgomery High School           2394
Green High School                2300
Dixon High School                1844
Wagner High School               1799
Silva High School                1292
Woods High School                1213
Sullivan High School             1140
Turner High School                989
Bowers High School                948
Fisher High School                933
Richard High School               643
Campos High School                640
Odonnell High School              543
Campbell High School              475
Chang High School                 193

In [23]:
# Find the average math score by grade for each school type using the groupby and mena functions

# Pending round up

avg_by_grade = new_student_df.groupby(['school_type', 'grade']).mean()
avg_by_grade.loc[:, ["math_score"]]

                   math_score
school_type grade
Charter     9       70.250024
            10      66.365173
            11      68.081058
            12      60.396502
Public      9       63.783584
            10      63.731571
            11      59.235906
            12      63.656714

# Deliverable 6: Report Findings

#### By performing this analysis I noticed that the math scores are higher at the Charter School than at Public, but the reading scores are a bit higher in most of the grades at the Public High Schools. Also, it's worth to mention that Public Schools have a higher budget. So we could look closer to the Public Schools with the lowest math scores to take any decision if needed regarding those specific schools.